import 'package:flutter/material.dart';
import 'package:flutter_text_viewer/flutter_text_viewer.dart';
import 'package:flutter_text_viewer/screen/text_viewer_page.dart';

class Health extends StatelessWidget {
  const Health({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(appBar:
        AppBar(
        backgroundColor: Colors.blue[200],
        title: Text("نصائح لمرضي السكري"),),
      body: Padding(
        padding: const EdgeInsets.all(8.0),
    child: ListView(
    children:[ Column(
    crossAxisAlignment: CrossAxisAlignment.center,
    children: [
      Image(
        image:
        AssetImage('assets/images/20210621110646646.jpg'),
      ),

     // TextViewerPage(textViewer: TextViewer('')),
      Text  ('  1- حمية منخفضة الكربوهيدرات                 '
      '\n'

      'يجب ألا تزيل الكربوهيدرات تمامًا من طعامك ، بل عليك اتباع نظام غذائي منخفض الكربوهيدرات، نصح لوك بأنه يجب عليك اتباع "نظام غذائي منخفض الكربوهيدرات" بدلاً من "نظام غذائي خالٍ من الكربوهيدرات".'

'\n'


      '2. البروتين والدهون الجيدة'
'\n'
     ' حاول أن تستهلك الكميات المناسبة من البروتين والدهون الجيدة حسب متطلبات واحتياجات نوع جسمك.'
'\n'
     ' 3. المشي بعد الوجبات'
'\n'
      'من المهم أن تمشي 10 دقائق على الأقل بعد الوجبات، سوف يساعدك على هضم الطعام بشكل صحيح وبمعدل أسرع.'

'\n'

      '4. فاكهة منخفضة السكريات'
'\n'
     ' يجب عليك التقليل من تناول الفاكهة وتناول ثمار منخفضة نسبة السكر في الدم (GI منخفض) فقط إذا لزم الأمر، بالنسبة لمرضى السكر ، من الآمن تناول ثمار منخفضة المؤشر الجلايسيمي في أي يوم.'

'\n'

      '5. التمرين'
'\n'
    ' اجعل التمرين جزءًا من روتينك اليومي، تذكر أنك لست مضطرًا لممارسة الرياضة كثيرًا حتى ينتهي بك الأمر بإرهاق نفسك أكثر من اللازم أو تشعر بالتعب ولكن ليس بالقليل أيضًا، ابحث عن التوازن أثناء ممارسة الرياضة.'


'\n'

      '6. النوم'
'\n'
      'اعمل على "عادات النوم العميق"، يجب ألا تتنازل عن نومك، امنح جسمك الراحة التي يحتاجها.'

'\n'

      '7. الصحة العاطفية'
'\n'
      'عليك أن تواصل العمل باستمرار على صحتك العاطفية لتعيش حياة سعيدة وصحية.'
'\n'
      '8. تقليل علامات الالتهاب'
'\n'
     ' الابتعاد عن الأطعمة التي تؤدي إلى الالتهاب ومشاكل أخرى.'
'\n'
      '9. نظام غذائي صحي'
'\n'
    ' اتبع خطة نظام غذائي صحي، حاول تضمين التوابل والأعشاب والخضروات والماء والبذور والمكسرات والألياف القابلة للذوبان وغير القابلة للذوبان في نظامك الغذائي.'

'\n'

     ' 10.  الصوم المتقطع'
'\n'
   ' يمكنك القيام بذلك ولكن فقط عندما تعلم أنك تفعل ذلك بالطريقة الصحيحة، الصيام المتقطع هو نمط من الأكل بين فترات الأكل والصيام.')
    ],
      )],),
      ),
    );
  }
}
